// Дано n - размер матрицы. Пользуясь двумя циклами и одним ветвлением выведете на экран:
// 1 0 0 0 0 0 0 0 0 0
// 0 1 0 0 0 0 0 0 0 0
// 0 0 1 0 0 0 0 0 0 0
// 0 0 0 1 0 0 0 0 0 0
// 0 0 0 0 1 0 0 0 0 0
// 0 0 0 0 0 1 0 0 0 0
// 0 0 0 0 0 0 1 0 0 0
// 0 0 0 0 0 0 0 1 0 0
// 0 0 0 0 0 0 0 0 1 0
// 0 0 0 0 0 0 0 0 0 1

let n = 10;
for (let i = 0; i < n; i++) {
  let str = '';
  for (let j = 0; j < n; j++) {
    if (i === j) {
      str += '1';
    } else {
      str += '0';
    }
  }
  console.log(str);
}
